# Phonemes to Viseme based on below link and polly-dg.pdf(en-US)
# https://en.wikipedia.org/wiki/ARPABET
import nltk
import re

arpabet = {'AA', 'AE', 'AH', 'AO', 'AW', 'AX', 'AXR', 'AY', 'EH', 'ER', 'EY', 'IH', 'IX', 'IY', 'OW', 'OY',
           'UH', 'UW', 'UX', 'B', 'CH', 'D', 'DH', 'DX', 'EL', 'EM', 'EN', 'F', 'G', 'HH', 'JH', 'K', 'L',
           'M', 'N', 'NG', 'P', 'Q', 'R', 'S', 'SH', 'T', 'TH', 'V', 'W', 'WH', 'Y', 'Z', 'ZH'}
visemes = {'p', 't', 'S', 'T', 'f', 'k', 'i', 'r', 's', 'J', 'u', '@', 'a', 'e', 'E', 'i', 'o', 'O'}
arpa2vi_dict = {'AA': 'a', 'AE': 'a', 'AH': 'E', 'AO': 'O', 'AW': 'a', 'AX': '@', 'AXR': '@', 'AY': 'a',
                'EH': 'E', 'ER': 'E', 'EY': 'e', 'IH': 'i', 'IX': 'i', 'IY': 'i', 'OW': 'o', 'OY': 'O',
                'UH': 'u', 'UW': 'u', 'UX': 'u', 'B': 'p', 'CH': 'S', 'D': 't', 'DH': 'T', 'DX': 'r',
                'EL': 'l', 'EM': 'm', 'EN': 'n', 'F': 'f', 'G': 'k', 'HH': 'k', 'JH': 'S', 'K': 'k',
                'L': 't', 'M': 'p', 'N': 't', 'NG': 'k', 'P': 'p', 'Q': 'k', 'R': 'r', 'S': 's', 'SH': 'S',
                'T': 't', 'TH': 'T', 'V': 'f', 'W': 'u', 'WH': 'u', 'Y': 'i', 'Z': 's', 'ZH': 'S'}
ipa2vi_dict = {'g': 'k', 'k': 'k', 'k͈': 'k', 'ŋ': 'k', 'h': 'k', 'l': 't', 'n': 't', 't': 't', 't͈': 't', 'm': 'p',
               'p': 'p', 'p_': 'p', 's': 's', 's͈': 's', 't͡ɕ': 'J', 't͡ɕʰ': 'J', 'tʰ': 't', 'pʰ': 'p', 'p͈': 'p',
               't͈͡ɕ': 'J',
               'a': 'a', 'ja': 'ia',
               'ʌ': 'E', 'jʌ': 'E',
               'o': 'o', 'jo': 'io',
               'u': 'u', 'ju': 'iu',
               'ɯ': 'i', 'i': 'i',
               'je': 'iE', 'jɛ': 'iE',
               'ɯj': 'i', 'wi': 'ui', 'wa': 'ua', 'wɛ': 'wE', 'we': 'wE', 'wʌ': 'ua',
               'e': 'E', 'ɛ': 'E'}
pho2vi_dict = {**arpa2vi_dict, **ipa2vi_dict}

def pho2vi(phoneme_list):
    """ Convert list of phoneme into list of viseme. """
    result = []
    for i in phoneme_list:
        if i in [' ', '']:
            continue
        a = pho2vi_dict.get(re.sub('[0-9]', '', i), None)
        assert a is not None, 'unknown phoneme: %s' % i
        if len(a) != 1:
            result.extend(list(a))
        else:
            result.append(a)
    return result


# # For testing
# cmu_d = nltk.corpus.cmudict.dict()
# f = open("data.txt", 'r')
# out = open("en_viseme.txt", 'w')
# for l in f.readlines():
#     out.write("%s\n" % pho2vi(cmu_d[l.strip()][0]))
# f.close()
# out.close()
# ko_pho = [['n', 'a', ' ', 'p͈', 'ɯ', 'n'], ['m', 'u', ' ', 'l', 'ʌ', ' ', 'p\x08', 'o', ' ', 'g', 'i', ' '],
#           ['k', 'ɯ', 'n'], ['g', 'o', ' ', '', 'jo', ' ', 'h', 'a', 'n'], ['m', 'ʌ', ' ', 's', 'i', 'n', 'n', 'ɯ', 'n'],
#           ['', 'ʌ', ' ', 't', 'u', ' ', '', 'u', 'n'], ['t͡ɕ', 'ʌ', 'l', 't', 'a', 'n'], ['k', 'i', ' '],
#           ['g', 'o', 'ŋ', 't͡ɕ', 'ʌ', 'ŋ', 'h', 'a', 'n'], ['p͈', 'a', ' ', 'l', 'ɯ', 'n'],
#           ['s', 'ɯ', 'l', 'pʰ', 'ʌ', ' '], ['t͡ɕ', 'a', 'ŋ', 's', 'o', ' '], ['s', 'a', ' ', 'l', 'a', 'ŋ'],
#           ['s', 'ɛ', 'ŋ', 'm', 'jʌ', 'ŋ'], ['s', 'i', ' ', 'g', 'a', 'g'], ['s', 'o', ' ', 'n', 'jʌ', ' '],
#           ['p\x08', 'a', 'm'], ['k͈', 'u', 'm'], ['t͡ɕ', 'a', 'l', 'm', 'o', 't͈', 't͈', 'e', 'n'],
#           ['l', 'e', ' ', '', 'a', 'l'], ['n', 'ɛ', ' ', 'l', 'jʌ', ' ', 'g', 'a', ' ', 'n', 'ɯ', 'n'],
#           ['', 'jʌ', 'ŋ', 'h', 'o', 'n'], ['pʰ', 'jʌ', 'ŋ', 'g', 'ju', 'n'], ['m', 'a', ' ', '', 'ɯ', 'm'],
#           ['tʰ', 'a', ' ', 't', 'a', ' '], ['g', 'o', ' ', 'tʰ', 'o', 'ŋ'], ['h', 'a', ' ', 't', 'a', ' '],
#           ['k', 'i', ' ', 's', 'ɯ', ' '], ['t͈', 'ʌ', 'l', 'l', 'i', 'm'],
#           ['', 'o', ' ', 'n', 'ɯ', 'l', 'p\x08', 'a', 'm'], ['', 'ʌ', 'p_', 's͈', 'i', ' '],
#           ['p\x08', 'u', 'n', 'n', 'o', ' '], ['t͡ɕ', 'a', ' ', 'g', 'ɯ', 'n'], ['', 'a', ' ', 'g', 'a', ' '],
#           ['t͡ɕ', 'u', ' ', '', 'wi', ' ', '', 'e', ' '], ['', 'a', ' ', 'pʰ', 'ɯ', ' ', 'l', 'o', ' '],
#           ['t', 'wi', ' ', 'l', 'o', ' '], ['g', 'a', 'g', 't͈', 'o', ' '], ['h', 'o', ' ', 'h', 'ɯ', 'p_'],
#           ['h', 'o', 'n', 't͡ɕ', 'a', ' '], ['s', 'ʌ', 'ŋ', 'n', 'a', 'n'], ['t͡ɕʰ', 'ʌ', 'n', 's', 'a', ' '],
#           ['t', 'ɛ', ' ', 't', 'a', 'p_'], ['g', 'a', 'm', 'g', 'a', 'g'], ['m', 'o', 't͈'],
#           ['t͈', 'ʌ', ' ', 'l', 'ʌ', ' ', 't͡ɕ', 'ʌ', ' '], ['', 'i', ' ', 's', 'a', 'ŋ', 'h', 'a', 'n'],
#           ['h', 'ɛ', 'ŋ', 'p\x08', 'o', 'g'], ['', 'ɯ', ' ', 'm', 'a', 'g'],
#           ['m', 'u', ' ', 's', 'ʌ', ' ', '', 'u', 'n'],
#           ['k͈', 'a', 'm', 't͈͡ɕ', 'a', 'ŋ', 'n', 'o', 'l', 'l', 'a', 'n'],
#           ['n', 'a', 't͈', 's͈', 'ʌ', 'n', 's', 'a', ' ', 'l', 'a', 'm'],
#           ['n', 'u', 'n', 'p\x08', 'u', ' ', 's', 'i', 'n'], ['p\x08', 'i', 'n', 'n', 'a', ' ', 'n', 'ɯ', 'n'],
#           ['t͡ɕ', 'ʌ', 'n', 'm', 'a', 'ŋ'], ['', 'ju', ' ', 'm', 'jʌ', 'ŋ', 'h', 'a', 'n'], ['h', 'i', 'm'],
#           ['g', 'o', 'ŋ', 's', 'a', 'ŋ'], ['s͈', 'ɯ', ' ', 't', 'a', ' '], ['s', 'ɛ', 'ŋ', 'g', 'a', 'g'],
#           ['', 'jʌ', ' ', 'n', 'i', 'n'],
#           ['g', 'a', ' ', 't͡ɕ', 'a', 'ŋ', 's', 'a', ' ', 'l', 'a', 'ŋ', 'h', 'a', ' ', 'n', 'ɯ', 'n'],
#           ['m', 'a', ' ', 's', 'i', 'n', 'n', 'ɯ', 'n'], ['t͡ɕ', 'u', 'ŋ', 't', 'ɛ', ' ', 'h', 'a', 'n'],
#           ['g', 'o', ' ', 't', 'o', ' ', 'k', 'a', 'n'], ['', 'i', 'n', 'g', 'i', ' ', '', 'i', 'n', 'n', 'ɯ', 'n'],
#           ['g', 'ɯ', 'g', 't͈', 'a', 'n'], ['g', 'a', ' ', 'h', 'a', 'g'], ['h', 'a', 'm', 'k͈', 'e', ' '],
#           ['p\x08', 'u', 'l', 'h', 'ɛ', 'ŋ', 'h', 'a', 'n'], ['', 'jʌ', 'g', 's͈', 'a', ' '],
#           ['s', 'ʌ', 'l', 'm', 'jʌ', 'ŋ'], ['m', 'jʌ', 'ŋ', 'h', 'wa', ' ', 'k', 'a', 'n'],
#           ['m', 'u', ' ', 'h', 'a', ' ', 'n', 'ɯj', ' '],
#           ['n', 'o', 'l', 'l', 'a', 'l', 'm', 'a', 'n', 'h', 'a', 'n'],
#           ['g', 'e', 'ŋ', 't͡ɕ', 'a', 'ŋ', 'h', 'a', 'n'],
#           ['k', 'ʌ', 'm', 'pʰ', 'ju', ' ', 'tʰ', 'ʌ', ' '],
#           ['g', 'i', ' ', '', 'i', ' '], ['', 'a', ' ', 'g', 'ɯj', ' ', '', 'i', 'n', 'n', 'ɯ', 'n'],
#           ['g', 'a', 'g', 't͈͡ɕ', 'a', ' ', 'm', 'o', ' ', 't', 'u', ' '],
#           ['', 'jʌ', ' ', 'l', 'ʌ', ' ', 'p\x08', 'u', 'n'], ['g', 'a', ' ', 'n', 'ɯ', 'ŋ', 'h', 'a', 'n'],
#           ['h', 'a', 'g'], ['tʰ', 'e', 'l', 'l', 'e', ' ', 'p\x08', 'i', ' ', 't͡ɕ', 'ʌ', 'n'],
#           ['h', 'ɯ', 'ŋ', 'm', 'i', ' ', '', 'i', 'n', 'n', 'ɯ', 'n'], ['m', 'o', ' ', 'h', 'o', ' ', 'h', 'a', 'n'],
#           ['p\x08', 'o', 'g', 't͈͡ɕ', 'a', ' ', 'pʰ', 'a', 'n'], ['t͡ɕ', 'a', 'ŋ', 'n', 'a', 'n'],
#           ['', 'wi', ' ', 'h', 'ʌ', 'm', 'h', 'a', 'n'], ['', 'a', ' ', 'l', 'ɯ', 'm', 't', 'a', ' ', '', 'u', 'n'],
#           ['', 'ʌ', 'm', 't͡ɕʰ', 'ʌ', 'ŋ', 'n', 'a', 'n'], ['t͡ɕʰ', 'a', ' '],
#           ['t͡ɕ', 'ʌ', 'n', 'n', 'ɯ', 'ŋ', 't͡ɕ', 'a', ' '], ['p\x08', 'i', ' ', 'h', 'ɛ', 'ŋ', 'g', 'i', ' '],
#           ['m', 'a', 'g', 't͈', 'ɛ', ' ', 'h', 'a', ' ', 'g', 'e', ' '],
#           ['g', 'i', ' ', 's', 'u', 'l', 't͡ɕ', 'ʌ', ' ', 'g', 'ɯ', ' ', 'l', 'o', ' '], ['g', 'a', ' ', 'g', 'u', ' '],
#           ['t͡ɕ', 'a', ' ', '', 'ɛ', ' ', 'l', 'o', ' ', '', 'u', 'n'],
#           ['m', 'i', ' ', 't', 'ɯ', 'l', 's͈', 'u', ' ', '', 'ʌ', 'm', 'n', 'ɯ', 'n'],
#           ['', 'i', ' ', 's', 'a', 'ŋ', 'h', 'a', 'n']]
# out2 = open("ko_viseme.txt", 'w')
# for l in ko_pho:
#     out2.write("%s\n" % pho2vi(l))
